# 1. Поработайте с переменными, создайте несколько, выведите на экран,
# запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.

value_int = 2020;
print(value_int)
value_str = "Привет!"
print(value_str)

Number1 = int(input("Введите, сколько вам лет числом >>>"))
Number2 = int(input("Введите, какой сейчас год числом >>>"))

str1 = input("Введите свое имя >>>")
str2 = input("Введите свою фамилию >>>")

# выведем каждую переменную на отдельной строке
print(Number1)
print(Number2)
print(str1)
print(str2)

# выведем все переменные в одной строке
print(Number1, Number2, str1, str2)
